var x=+prompt("Вкажіть ваше улюблене число","");
var n=2;
alert("квадрат цього числа дорівнює "+(x**n));

var a=+prompt("Вкажіть будь-яке число","");
var b=+prompt("Вкажіть інше будь-яке число","");
alert("Сума дорівнює "+(a+b)+", різниця дорівнює "+(a-b)+", ділення дорівнює "+(a/b)+", остача дорівнює "+(a%b) ); 

var c=+prompt("Вкажіть будь-яке число","");
var d=+prompt("Вкажіть будь-яке число","");
alert("якщо перше більше другого, то "+(c>d)+", якщо перше менше другого, то "+(c<d)+", якщо перше дорівнює другому, то "+(c===d));